{
  "translation": {
    "test": {
      "helloWorld": "Привет, мир!"
    },
    "toast": {
      "successCopy": "Успешно скопировано"
    },
    "settings": {
      "lang": "Язык",
      "changeLang": "Сменить язык",
      "support": "Поддержка",
      "aboutApp": "О приложении",
      "logout": "Выйти",
      "sureAboutExit": "Уверены, что хотите выйти?"
    },
    "signIn": {
      "chooseLang": "Выберите язык",
      "introduce": "Представьтесь",
      "namePlaceholder": "Введите имя",
      "enter": "Войти"
    },
    "profile": {
      "yourKey": "Ваш ключ"
    },
    "game": {
      "singleGame": "Одиночная игра",
      "teamGame": "Командная игра",
      "friendList": "Список друзей",
      "phrasesList": "Список фраз"
    },
    "friendList": {
      "addFriend": "Добавить друга",
      "emptyList": "Список друзей пуст",
      "enterKey": "Введите ключ",
      "insert": "Вставить",
      "add": "Добавить",
      "qrAdd": "Сканировать QR-code",
      "or": "Или"
    },
    "qrScreen": {
      "cameraPermission": "Разрешение камеры",
      "weNeedPermissionUseCameraScanQrCode": "Нам нужно разрешение на использование камеры для сканирования QR-кода",
      "good": "Хорошо",
      "cancel": "Отмена",
      "placeTheQRCodeInTheMiddle": "Поместите QR-код посередине. Он будет отсканирован автоматически.",
      "close": "Закрыть",
      "scanQrCodeYouNeedPermissionUseCamera": "Для сканирования QR-кода необходимо разрешение на использование камеры."
    },
    "phraseList": {
      "addPhrase": "Добавить фразу",
      "emptyList": "Список фраз пуст",
      "enterPhrase": "Введите фразу",
      "insert": "Вставить",
      "add": "Добавить",
      "clear": "Очистить список фраз"
    },
    "createGame": {
      "enterGameName": "Введите название игры",
      "start": "Начать",
      "invitePlayers": "Пригласить игроков"
    },
    "singleGame": {
      "ready": "Готов",
      "play": "Сыграть",
      "emptyPhraseList": "Список фраз пуст. \n Добавьте фразы (не меньше 2)",
      "noReady": "Не готов"
    },
    "finishGame": {
      "results": "Результаты игры",
      "winner": "Победитель",
      "chance": "Шанс",
      "finishGame": "Закончить"
    },
    "inviteModal": {
      "invToPlay": "приглашает сыграть в",
      "accept": "Принять",
      "decline": "Отклонить"
    },
    "teamGame": {
      "addPlayer": "Добавить игрока",
      "emptyPlayersList": "Список игроков пуст. \n Добавьте игроков (не меньше 1)",
      "begin": "Начать",
      "waitPlayers": "Ожидание игроков",
      "gameHost": "Ведущий игры",
      "viewPhraseList": "Посмотреть список фраз"
    },
    "aboutApp": {
      "appGit":  "Github приложения",
      "author": "Автор",
      "authorGit": "Github автора",
      "version": "Версия",
      "link": "Ссылка"
    },
    "newVersion": {
      "title": "Вышла новая версия приложения. Нужно обновить.",
      "button": "Хорошо"
    },
    "supportScreen": {
      "writeMe": "Если вы обнаружили ошибку или хотите предложить идею по улучшению приложения, вы можете написать мне на email",
      "distributionRules": "Приложение распространяется совершенно бесплатно, плата за использование не взимается.",
      "helpData": "Хотя приложение полностью бесплатное, вы всегда можете поддержать автора, если хотите."
    },
    "rulesScreen": {
      "rules": "Правила",
      "t1": {
        "header": "О чем приложение:",
        "desc": "WeDoRandom - это приложение, с помощью которого вы можете сделать выбор \"подбросив монетку\". Играя в одиночную игру, можно решить, с каким вкусом выбрать кофе или пойти тусить сегодня или нет. Вместе с друзьями в командной игре можно решить, какое кино смотреть вечером или пиццу с каким вкусом заказывать."
      },
      "t2": {
        "header": "Возможности приложения:",
        "desc": "WeDoRandom позволяет авторизоваться по вашему имени с уникальным 16-значным ключом. Этот ключ в дальнейшем является вашим уникальным идентификатором: ваши друзья могут вас добавляь по этому ключу вручную или с помощью QR-кода. При выходе из приложения или удаления с телефона - ваш аккаунт удаляется навсегда. Список ваших друзей хранится в базе данных на сервере, а часто используемые фразы - нет, только конкретно в вашем телефоне. Приложение полностью переведено на 3 языка."
      },
      "t3": {
        "header": "Одиночная игра:",
        "desc": "Для одиночной игры вам необходимо ввести название - что конкретно вы не можете решить, например, пойти погулять вечером. Далее необходимо добавить список фраз на игровое поле (не меньше 2-х). Когда будете готовы - прожмите статус готовности и жмите \"Играть\". На последнем экране вы увидите ту фразу, которая выиграла и шанс выпадения. "
      },
      "t4": {
        "header": "Командная игра:",
        "desc": "Для начала командной игры вам также необходимо ввести название игры. Затем вам необходимо пригласить друзей играть с вами: вы можете пригласить из своего списка друзей или по уникальному ключу - добавить вручную или QR-кодом. Обратите внимание: приглашение можно отправить только пользователю, который в данный момент не играет в какой либо вид игры. Пользователь, которому вы отправите приглашение, увидит модальное окно с инвайтом в игру, как только зайдет в приложение. Когда все приглашенные примут игру - вы сможете нажать на кнопку \"Начать\". На следующем экране вы с другими игроками добавляете фразы в игру - каждый имеет возможность видеть и удалять только свои фразы. Чтобы сыграть необходимо добавить минимум 2 фразы. Когда игрок готов - он жмет кнопку готовности и ждет всех остальных - за статусом игры можно следить в верхнем правом углу. Когда все игроки будут готовы - лидер игры может нажать на кнопку \"Сыграть\" и вы все перейдете на последний экран - результаты игры."
      },
      "t5": {
        "header": "Список друзей:",
        "desc": "Список друзей используется как список игроков, с которым вы играете чаще обычного. Добавить можно по уникальному ключу или с помощью QR-кода: найти их можно на странице \"Профиль\". Приложение отслеживает статус друга в режиме реального времени - вы увидите, если друг \"в сети\". Обратите внимание - друг добавляется только в ваш список друзей, чтобы вы отображались у него в друзъях - нужно повторить все действия в его приложении."
      },
      "t6": {
        "header": "Список фраз:",
        "desc": "Список фраз работает исключительно на вашем устройстве - хранение происходит в базе данных вашего телефона. Вы можете добавлять фразы для игр заранее, или, в процессе игры - каждая фраза, добавленная во время любой игры автоматически добавляется в ваш список фраз."
      }
    }
  }
}